[{"model": "blog.post", "pk": 1, "fields": {"title": "SMART Fitness Goals", "slug": "post-1", "intro": "Whether you’re in the fitness industry or not, you may have heard of SMART fitness goals.", "image_url": "https://images.unsplash.com/photo-1571019614242-c5c5dee9f50b?ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&ixlib=rb-1.2.1&auto=format&fit=crop&w=1770&q=80", "image": "", "body": "Standing for Specific, Measurable, Achievable, Relevant, and Time-Bound, the acronym is most commonly used as a criteria for personal trainers to set goals for their clients.\r\nThere are a whole host of benefits to setting SMART fitness goals, but also some potential drawbacks to consider. We’ll discuss all of this and more- as well as some SMART fitness goals examples.", "body_sub_header": "What Are SMART Goals?", "body_text": "Vague, unrealistic goals too often lead to disappointment. When we feel like we’re failing at reaching our fitness goals, we give up and decide we simply can’t do it. We compare ourselves to the people around us and wonder why they seem to be able to achieve what we can’t.\r\n\r\nSMART goals are key to becoming fit and healthy. SMART is an acronym that stands for specific, measurable, attainable, relevant, and time-bound. This five-step method allows you to create goals that are realistic and achievable, setting yourself up for long-term success.\r\n\r\nAs long as your fitness goals include each of these characteristics, you can reach them.", "date_added": "2021-10-22T12:54:37.164Z"}}, {"model": "blog.post", "pk": 2, "fields": {"title": "Realistic Fitness Goals To Set This Year", "slug": "post-2", "intro": "And Exactly How to Accomplish Them", "image_url": "https://images.unsplash.com/photo-1616803689943-5601631c7fec?ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&ixlib=rb-1.2.1&auto=format&fit=crop&w=1770&q=80", "image": "", "body": "You know how it goes: we all start out the year with aspirations to get fit, get healthy, and be our best selves. But when those fitness goals are based on long-term ideas of how we want to look (“lose 10 pounds,” “go down a pants size,” “get abs,”) rather than short-term goals on how we want to feel, those goals fall through in a matter of months or even weeks, and you feel let down, disappointed, and like a failure.\r\n\r\nInstead of the endless cycle of weight-focused fitness goals, and make goals based on what’s actually good for you, and goals that you’ll actually be able to stick to. When you focus on what your body can do, rather than how your body looks, you’ll start to appreciate it so much more, and want to give it more of what it needs to be its healthiest. Replace your fitness goals that are focused on the way you look or the way your pants fit with these 14 goals that will make you *actually* stronger, healthier, and better:", "body_sub_header": "1. Try one new workout every month", "body_text": "Having a fitness routine is important, but always having the same fitness routine? Not great. For one reason, your body gets used to the same movements, miles, or weights, and in order to keep getting stronger, you should always be challenging yourself. More importantly, if you stick to the same exact workout routine every day, you’ll get bored. Being bored will make you less likely to want to work out, and the key to consistent exercise is not willpower, it’s enjoyment. News flash: exercise should be fun.", "date_added": "2021-10-22T12:57:08.494Z"}}, {"model": "blog.post", "pk": 3, "fields": {"title": "Warm-Up and Get Ready To Move", "slug": "warm-up-post-3", "intro": "If warm-up is just something you do instinctively without much thought, you will want to read this.", "image_url": "https://images.unsplash.com/photo-1522898467493-49726bf28798?ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&ixlib=rb-1.2.1&auto=format&fit=crop&w=1770&q=80", "image": "", "body": "Sometimes in our eagerness to get our workout started and start sweating, we forget an important element of any fitness regime: warm-up.", "body_sub_header": "We often hear about how important that part of a workout routine is, especially to reduce injury, but how much do we actually know about the process?", "body_text": "What Is Warm Up Anyway?\r\nWarm-up involves a variety of exercises that focus on building and improving your basic movement and sports skills, which you can then apply to whatever physical activity you’re going to do. What it does, essentially, is prepare your body for the kinds of movements you’d expect to do during a workout.\r\n\r\nWhy Warm Up?\r\nWhen you engage in warm-up exercises, you’re preparing your body for more intense movements, which in turn will enhance the way you move. This has both short- and long-term benefits: it doesn’t just reduce your risk of injuries during a workout session, but also helps you improve the way you move and reduce muscle soreness.\r\n\r\nHow Does It Work?\r\nWhen warming up, you rev up your body temperature and increase blood flow to the muscles you’re going to put through the grind. You just want to stay warm, not get all fired up, so keep the exercises short and sweet to avoid causing fatigue and altering your training results. There are numerous types of warm-up exercises you can do such as SMR, Dynamic Stretching, Mobilisation, and Activation Movements, to name a few.\r\n\r\nWhat is SMR\r\nThis stands for self-myofascial release, a method of eliminating or easing trigger points while restoring tissue integrity. This warm-up targets the tissues surrounding the muscles, to improve the range of motion in the joints, reduce soreness, encourage tissue recovery and decrease the overall effects of stress on your body’s movement system.\r\n\r\nWhat is Dynamic Stretching\r\nDynamic stretching involves moving through a challenging (but comfortable) range of motion over and over again to improve the range of motion in your muscles and tendons, plus reduce the risks of injury. It’s also great for conditioning your athletic performance. If you’ve seen people doing reverse lunges, knee hugs, leg cradles, and kneeling hip flexors during warm-up, they are performing dynamic stretching. Remember though that this warm-up requires you to be mindful of your coordination and that you should do it in a controlled, smooth, and deliberate manner.\r\n\r\nWhat is Mobilisation\r\nMobilization takes a full-body approach to improve your ability to move and perform efficiently. It is movement-based and is great for helping to decrease pain or discomfort. It can help improve your posture and movement capacity too.\r\n\r\nWhat is Activation\r\nActivation is meant to wake your muscles up and usually focuses on the core and hips. This approach can help you gain better strength and minimize the risk of injury by preparing your whole body for the workout you’re about to put it through. Some examples include planks (and side planks), glute bridge, miniband forward, and lateral walks. Perform a couple of sets (of 10-15 reps each) using slow, controlled movements for the best results.", "date_added": "2021-10-25T11:01:10.035Z"}}]